tap "daipeihust/tap"
tap "homebrew/bundle"
brew "autojump"
brew "awscli"
brew "bat"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "harfbuzz"
brew "httpie"
brew "ios-deploy"
brew "k6"
brew "libfido2"
brew "lsd"
brew "mas"
brew "mvfst"
brew "mysql@8.0"
brew "nmap"
brew "postgresql@14", restart_service: :changed
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "tig"
brew "tree"
brew "watchman"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "daipeihust/tap/im-select"
cask "chatgpt"
cask "claude"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "karabiner-elements"
cask "logitech-options"
cask "obsidian"
cask "pgadmin4"
cask "postman"
cask "scroll-reverser"
cask "sourcetree"
cask "visual-studio-code"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inkyojeong.simple-front-snippets"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "pkief.material-icon-theme"
vscode "rangav.vscode-thunder-client"
vscode "ritwickdey.liveserver"
vscode "rogeraabbccdd.dark-red-theme"
vscode "roscop.activefileinstatusbar"
vscode "sdras.night-owl"
vscode "streetsidesoftware.code-spell-checker"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "withfig.fig"
